Revit 2020 API
WoodPoreType Enumeration
 The enumerated type representing the permitted values for the asset property "WoodPoreType" from the "PrismWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public enum WoodPoreType
Visual Basic
Public Enumeration WoodPoreType
Visual C++
public enum class WoodPoreType
Members
Member name | Description
InBothWoods
EarlywoodOnly
LatewoodOnly
See Also
Autodesk.Revit.DB.Visual Namespace